<script>
export default {
    name: "DocsStat"
}
</script>

<template>
    <div>
        <h1 class="has-text-centered">Статистика </h1>
        <p>Дозволяє рахувати статистику в іграх з петанку. Аналізувати дані по багатьом критеріям</p>
        <h2>Налаштування гри</h2>
        <p>Із основних налаштувань треба вказати тільки назву гри та формат гри (триплет, дуплет чи тет). А також бажано вказати гравців.</p>
        <img src="@/assets/img/docs/stat1.png" alt="Interface" class="image">
        <ol>
            <li>Назва гри як вона буде відображатись в списку</li>
            <li>Теги гри. Це ключові слова яким можна описати гру і завдяки яким можна буде в майбутньому фільтрувати дані. Наприклад, вам може бути цікаво як ви зіграли в іграх конкретного турніру. Або ви хочете аналізувати статистику по різним майданчикам. Управляти тегами можна натиснувши кнопку "Показати теги".</li>
            <li>Режим. Швидкий режим був зроблений, щоб було комфортніше записувати статистику під час гри як гравець. Це дозволяє менше часу заглядати в телефон. Детальніше нижче</li>
            <li>Якщо поставите цю галку, то цифри статистики будуть показуватись під час гри. Тобто по ним можна приймати рішення щодо заміни гравця. Якщо ви записуєте статистику як гравець - це може впливати на ваші думки під час гри.</li>
            <li>Вибрати систему підрахунку</li>
            <li>Сценарій гри. Тут можна вказати який результат кидку буде вказаний за замовчуванням. Якщо ви граєте як топові гравці світу, то вказуйте позитивний сценарій.</li>
        </ol>
        <h2>Процес ведення статистики</h2>
        <img src="@/assets/img/docs/stat2.png" alt="Interface" class="image">
        <ol>
            <li>Кожен раунд можна вказати на яку дистанцію грають гравці. Вибирати не обов'язково. Пле потім при аналізі статистики можна буде фільтрувати дані по дистанціям. Це задає дистанцію відразу для всіх кидків в цьому мені. Якщо хочете змінити відстань для конкретного кидка, дивіться 7 пункт.</li>
            <li>Поточна статистика команди у відсотках та в загальному (буде показуватись тільки якщо вибрана галка "Як тренер")</li>
            <li>Поточна статистика гравця (буде показуватись тільки якщо вибрана галка "Як тренер")</li>
            <li>Серія кидків гравця (зелений - результативний кидок, червоний - нерезультативний кидок, синій - каро (тільки при тирі))</li>
            <li>Скільки очок виграла команда в результаті зіграного раунду</li>
            <li>Зелений знак оклику показує, що це каро при тирі або поінт, при якому заграло 2 кулі</li>
            <li>Контекстне меню кидка. Показується при довгому натисканні на результат кидка (більше ніж пів секунди). Можна вказати додаткову ефективність кидка (при результативному шуті це означатиме каро, при промаху це означатиме вибиту свою кулю, при поінті це може значити або підбита своя куля або переміщений кошонет при якому заграло більше ніж одна куля). Також можна видалити кидок (актуально при швидкому режимі гри, коли був вибитий кошонет і не всі кулі були кинуті). Також можна змінити відстань конкретного кидка (актуально коли під час гри кошонет був переміщений)</li>
            <li>Тип і результат кидку. Перелючається простим натисканням</li>
            <li>Червоний знак оклику показує вибиту свою кулю при тирі або при поінті, якщо в результаті кидка заграла чужа куля</li>
            <li>Навігація між раундами</li>
        </ol>
        <h2>Результат гри</h2>
        <h2>Теги</h2>
        <h2>Заміни</h2>
        <h2>Аналіз</h2>
        <div class="has-text-centered">
            <router-link class="button is-success" to="/stats">Let's start</router-link>
        </div>
    </div>
</template>